In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
%matplotlib inline
import numpy as np

In [2]:
# Загрузка данных / chunksize=None
df = pd.read_csv('Churn_Modelling1.csv', index_col = 'RowNumber') #,chunksize=200

In [132]:
#df.columns

In [133]:
# первичный осмотр

#df.shape

In [134]:
#df

In [135]:
#df.info()

In [136]:
#df['Balance'] = df['Balance'].astype('float32')

In [137]:
#df['Surname'].value_counts().head(10)

In [138]:
#Доступ loc iloc
# df[(df['Geography'] == 'Germany')&(df['HasCrCard'] == 1)]['Age'].mean()

In [139]:
#df.columns

In [140]:
sli = df.loc[4:10, ['NumOfProducts','Age']]

In [141]:
#df[(df['Geography'] == 'Germany')&(df['HasCrCard'] == 1)]

In [142]:
#сортировка
#df.sort_values(['Surname', 'CreditScore'], ascending = [True, False])

In [143]:
# Изменение срезов df.loc[2:10, ['Geography', 'Gender', 'Age']]

In [144]:
#df.loc[2:10, ['Geography', 'Gender', 'Age']]

In [145]:
#sli.loc[4,'Age'] = 35

In [146]:
#sli

In [147]:
#df

In [148]:
#df['newCol'] = df['Balance'] + df['EstimatedSalary']

In [149]:
import math

In [150]:
#df['sinus'] = df['CreditScore'].apply(math.sin)

In [151]:
#df['CreditScore']

In [152]:
# добавление новых столбцов apply, map()

In [153]:
#dic = {'Female':0, 'Male':1}

In [154]:
#df['Gender'] = df['Gender'].map(dic)

In [ ]:
# Statistics
# std, min, max, median, mean, skew, kurt

In [ ]:
# Группировка / фреймы / дополнения статистиками / отобразить несколько столбцов
# it = df.groupby(['Geography','HasCrCard'])

In [23]:
it = df.groupby(['Geography'])

In [24]:
it

In [25]:
li = []

for i in it:
    print (i[0])
    li.append(i[1])

France
Germany
Spain

In [109]:
#li[1]#

In [39]:
# домашняя заготовка 
salary = df.groupby('Geography')['EstimatedSalary'].mean()
balance = df.groupby('Geography')['Balance'].mean()
balance.to_csv('Balance.csv')
salary.to_csv('salary.csv')

In [36]:
# Сводная таблица
#pt = df.pivot_table(values = 'Balance', index = 'Geography', columns = 'Gender', aggfunc = 'mean')

In [110]:
#pt

In [ ]:
#drop / inplace  (разница labels, axis / index / columns)

In [111]:
#df.drop(['Exited'], axis=1) #inplace = True

In [112]:
#df.shape

In [218]:
#df

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
RowNumber,,,,,,,,,,,,
1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88
2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57
4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63
5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10
...,...,...,...,...,...,...,...,...,...,...,...,...
9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64
9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77
9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58
9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52
10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78

In [ ]:
# Объединение датафреймов

In [41]:
salary = pd.read_csv('salary.csv')
balance = pd.read_csv('Balance.csv')

In [47]:
salary

  Geography  EstimatedSalary
1   Germany    101113.435102
2     Spain     99440.572281

In [221]:
#balance

  Geography     Balance
0    France   62092.637
1   Germany  119730.120
2     Spain   61818.150

In [46]:
#salary.drop(index = [0], inplace = True)

In [48]:
#balance.drop(index = [2], inplace = True)

In [53]:
#pd.concat([salary,balance])

  Geography  EstimatedSalary     Balance
1   Germany    101113.435102         NaN
2     Spain     99440.572281         NaN
0    France              NaN   62092.637
1   Germany              NaN  119730.120

In [50]:
#salary

  Geography  EstimatedSalary
1   Germany    101113.435102
2     Spain     99440.572281

In [51]:
#balance

  Geography     Balance
0    France   62092.637
1   Germany  119730.120

In [52]:
#pd.concat([balance, salary], axis = 1, join = 'outer')

  Geography     Balance Geography  EstimatedSalary
0    France   62092.637       NaN              NaN
1   Germany  119730.120   Germany    101113.435102
2       NaN         NaN     Spain     99440.572281

In [226]:
#salary.drop(labels = 2, axis = 0, inplace = True)
#balance.drop(labels = 0, axis = 0, inplace = True)

In [57]:
#pd.merge(balance, salary, how = 'right', on = 'Geography')

  Geography    Balance  EstimatedSalary
0   Germany  119730.12    101113.435102
1     Spain        NaN     99440.572281

In [58]:
df[(df['Geography'] == 'Germany')&(df['HasCrCard'] == 1)]['Age'].mean()

39.623673925181464

In [59]:
gdf = df[df['Geography'] == 'Germany']

# Визуализация

# 1. признаки по одному
### 1.1. количественные

In [114]:
#df['CreditScore'].hist();

In [113]:
# ящик с усами
#sns.boxplot(x = df['CreditScore']);

### 1.2. Категориальные

In [63]:
df['Geography'].value_counts()

France     5014
Germany    2509
Spain      2477
Name: Geography, dtype: int64

In [6]:
# most interest
#df['Exited'].value_counts()

In [115]:
# seaborn
#sns.countplot(x = df['Exited']);

In [116]:
#sns.countplot(x = df['Geography']);

In [117]:
#df['Surname'].value_counts().head()

In [68]:
# опасно
#sns.countplot(x = df['Surname']);

In [118]:
#df[df['Surname'].isin(df['Surname'].value_counts().head().index)]
#sns.countplot(x = df[df['Surname'].isin(df['Surname'].value_counts().head().index)]['Surname']);

# 2. Взаимодействие признаков
### 2.1. Количествнные с количественными

In [119]:
#df.columns

In [120]:
#factors = ['CreditScore','Age','EstimatedSalary','Balance']

In [121]:
#df[factors].hist();

In [122]:
#sns.pairplot(df[factors])

In [123]:
# 2 признака 

#plt.scatter(df['Age'], df['Balance'], color = 'green')
#plt.scatter(df['Age'], df['Balance'], color = df['Exited'].map({0:'blue', 1:'orange'}))
#plt.xlabel('Возраст')
#plt.ylabel('Баланс')

In [79]:
#df['Exited'].map({0:'green', 1:'red'})

In [124]:
#plt.scatter(df[df['Exited']==0]['Age'], df[df['Exited']==0]['Balance'], color = 'blue', label = 'Остались')
#plt.scatter(df[df['Exited']==1]['Age'], df[df['Exited']==1]['Balance'], color = 'orange', label = 'Свалили')
#df[df['Exited']==0]
#plt.xlabel('Возраст')
#plt.ylabel('Баланс')
#plt.title('Отток - баланс/возраст')
#plt.legend()

In [125]:
#sns.heatmap(df.corr())

### 2.2. Колич - Категориальный / Колич - Бинарный

In [126]:
#sns.boxplot(x = 'Exited', y = 'Age', data = df);

In [127]:
#sns.boxplot(x = 'Geography', y = 'Age', data = df);

In [128]:
#df.groupby('Geography')['Balance'].mean()

In [129]:
#sns.boxplot(x = 'Geography', y = 'Balance', data = df);

### 2.3. Категориальный - категориальный

In [130]:
#pd.crosstab(df['Exited'], df['Geography'])

In [131]:
#sns.countplot(x = 'Geography', hue = 'Exited', data = df)

In [92]:
from sklearn.manifold import TSNE

In [93]:
tsne = TSNE(random_state = 42)

In [97]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,newCol
RowNumber,,,,,,,,,,,,
1,619,France,Female,42,2,0.000000,1,1,1,101348.88,1,101348.880000
2,608,Spain,Female,41,1,83807.859375,1,0,1,112542.58,0,196350.439375
3,502,France,Female,42,8,159660.796875,3,1,0,113931.57,1,273592.366875
4,699,France,Female,39,1,0.000000,2,0,0,93826.63,0,93826.630000
5,850,Spain,Female,43,2,125510.820312,1,1,1,79084.10,0,204594.920313

In [96]:
df = df.drop(['CustomerId', 'Surname'], axis = 1)

In [100]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,newCol
RowNumber,,,,,,,,,,,,
1,619,France,Female,42,2,0.000000,1,1,1,101348.88,1,101348.880000
2,608,Spain,Female,41,1,83807.859375,1,0,1,112542.58,0,196350.439375
3,502,France,Female,42,8,159660.796875,3,1,0,113931.57,1,273592.366875
4,699,France,Female,39,1,0.000000,2,0,0,93826.63,0,93826.630000
5,850,Spain,Female,43,2,125510.820312,1,1,1,79084.10,0,204594.920313

In [101]:
#df['Geography'] = df['Geography'].map({'France': 0, 'Germany':1, 'Spain':2})

In [102]:
#df['Gender'] = df['Gender'].map({'Female': 0, 'Male':1})

In [98]:
tsne = TSNE(random_state = 0)

In [103]:
tsne.fit(df)

/home/sergey/anaconda3/lib/python3.9/site-packages/sklearn/manifold/_t_sne.py:780: FutureWarning: The default initialization in TSNE will change from 'random' to 'pca' in 1.2.
  warnings.warn(
/home/sergey/anaconda3/lib/python3.9/site-packages/sklearn/manifold/_t_sne.py:790: FutureWarning: The default learning rate in TSNE will change from 200.0 to 'auto' in 1.2.
  warnings.warn(

TSNE(random_state=0)

In [104]:
tsne.embedding_.shape

(10000, 2)

In [105]:
embedding = tsne.fit_transform(df)

/home/sergey/anaconda3/lib/python3.9/site-packages/sklearn/manifold/_t_sne.py:780: FutureWarning: The default initialization in TSNE will change from 'random' to 'pca' in 1.2.
  warnings.warn(
/home/sergey/anaconda3/lib/python3.9/site-packages/sklearn/manifold/_t_sne.py:790: FutureWarning: The default learning rate in TSNE will change from 200.0 to 'auto' in 1.2.
  warnings.warn(

In [106]:
embedding.shape

(10000, 2)

In [108]:
#plt.scatter(embedding[df.Exited == 0,0], embedding[df.Exited == 0,1], )
#plt.scatter(embedding[df.Exited == 1,0], embedding[df.Exited == 1,1], color = 'orange')